import { create } from "zustand"; // zustand store 생성하는 함수

// zustand 의 store란 전역 상태인 state와 해당 상태를 실제로 업데이트하는
// 액션 함수들이 포함된 객체

// 반환하는 객체가 store의 객체로 설정 됨
// create(() => {
//   return {
//     count: 0,
//     increse: () => {},
//     decrease: () => {},
//   };
// });

// 대부분 return 사용안하고 화살표 함수 사용시 바로 반환값 작성함
create(() => ({ count: 0, increse: () => {}, decrease: () => {} }));

// increse, decrease함수를 이용해 count값 변화시키기
// → create함수의 매개변수로 제공되는 set, get 함수 이용하기
// get : 객체 스토어를 그대로 반환하는 역할
//             ⌈-----여기 부분 객체 스토어임----------------------⌉
// set : 인수로 전달한 값으로 현재 스토어를 업데이트 시켜주는 함수
create(() => ({ count: 0, increse: () => {}, decrease: () => {} }));

create((set, get: any) => ({
  count: 0,
  increse: () => {
    const count = get().count;
    set({ count: count + 1 });
  },
  decrease: () => {},
}));

// immer같은 느낌으로 set메소드의 인수로 전달한 프로퍼티 기준으로
//  해당 프로퍼티만 업데이트하고 나머지는 유지시켜줌

type Store = {
  count: number;
  increase: () => void;
  decrease: () => void;
};

/**
 * 📃 set 함수는 함수형 업데이트를 지원함
 *    함수형 업데이트란
 *    → 인수로 callback 함수를 넣어줌으로써 콜백함수가 리턴하는 값으로 스토어를 업데이트 시킴
 *    → set 함수는 매개변수로 현재 스토어의 값이 제공됨
 *      위와 같은 함수를 뜻하며 대부분은 get메서드 쓸 필요없이 set 메서드를 통해 한번에 처리
 */

create((set, get) => ({
  count: 0,
  increse: () => {
    set((store: any) => {
      return { count: store.count + 1 };
    });
  },
  decrease: () => {},
}));

// 더 간결한 코드로도 작성 가능함
create((set, get) => ({
  count: 0,
  increase: () => {
    set((store: any) => ({
      count: store.count + 1,
    }));
  },
}));

// decrease도 구현해보기
// create 타입 변수 제네릭으로 정의하기

create<Store>((set, get) => ({
  count: 0,
  increase: () => {
    set((store) => ({
      count: store.count + 1,
    }));
  },
  decrease: () => {
    set((store) => ({
      count: store.count - 1,
    }));
  },
}));

/**
 * 📃 zustand의 create() 함수는 store 생성하는 데에 그치지 않고
 * 본인이 생성한 스토어에 접근할 수 있는 리액트 훅을 반환하기까지 함
 */

export const useCountStore = create<Store>((set, get) => {
  return {
    count: 0,
    increase: () => {
      set((store) => ({
        count: store.count + 1,
      }));
    },
    decrease: () => {
      set((store) => ({
        count: store.count - 1,
      }));
    },
  };
});

// → react 컴포넌트라면 useCountStore 훅을 불러 객체 형태의 store에 접근이 가능해짐
